Revit 2027 API
EnergyDataSettings.AnalyticalSpaceResolution Property
 Analytical Space Resolution defines the minimum gap between Revit elements that will be ignored in the identification of energy analytical model spaces. This setting is ignored if AnalysisType is RoomsOrSpaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AnalyticalSpaceResolution { get; set; }
Public Property AnalyticalSpaceResolution As Double
	Get
	Set
public:
property double AnalyticalSpaceResolution {
	double get ();
	void set (double value);
}
member AnalyticalSpaceResolution : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property:
Remarks
 The maximum distance between Revit elements that may be ignored in the identification of energy analytical model spaces is 2 times the Analytical Space Resolution setting.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace